Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.ProjectionPlaneInvalidWall Property
 Projection plane becomes invalid for this wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProjectionPlaneInvalidWall { get; }
Public Shared ReadOnly Property ProjectionPlaneInvalidWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProjectionPlaneInvalidWall {
	FailureDefinitionId^ get ();
}
static member ProjectionPlaneInvalidWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace